Repository: DlangRen/Programming-in-D-OmegaT
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: $(P There can be only one value per key.
zh_cn: $(P 每个键有且仅有一个对应值。

source: $(P These operators operate on class variables.
zh_cn: $(P 这些运算符应用在类变量上。

source: $(P This simple definition may be misleading.
zh_cn: $(P 这个简单的定义可能是个误导。

source: $(P This time the compilation error is due to the combination of two factors: )
zh_cn: $(P 这次的编译错误是因为两个因素碰了头： )

source: $(P Unlike structs, there is no automatic object construction where the constructor parameters are assigned to members sequentially: )
zh_cn: $(P 不像结构，构造函数参数按顺序分配给成员时，类没有自动构造对象： )

source: $(P Using the assignment operator is sufficient to build the association between a key and a value: )
zh_cn: $(P 使用赋值运算符就足以构建键与值的关联： )

source: $(P We can make the following observations about the use of these blocks: )
zh_cn: $(P 对于这些块的用法，我们可以作以下观测： )

source: $(P We have seen that single quotes are used to define character literals.
zh_cn: $(P 我们已经看到单引号用于定义字符字面量。

source: $(P We have used strings in many programs that we have seen so far.
zh_cn: $(P 迄今为至，我们已经看到，好多程序都用到了字符串。

source: $(P We may think of defining the variable as a $(C char[]) instead of the $(C string) alias but that cannot be compiled either: )
zh_cn: $(P 我们可能想到把变量定义为 $(C char[]) 而不是别名 $(C string)，但也不能通过编译： )

source: $(P We saw in the $(LINK2 /ders/d.en/arrays.html, Arrays chapter) that plain arrays are containers that store their elements side-by-side and provide access to them by index.
zh_cn: $(P 在 $(LINK2 /ders/d.cn/arrays.html, 数组) 一章中我们已经看到简单数组作为容器逐个存储元素，按索引访问它们。

source: $(P When the actual object needs to be copied, the class must have a member function for that purpose.
zh_cn: $(P 当需要复制实际的对象时，类必须有一个针对此目的的成员函数。

source: $(P When the input cannot be converted to $(C name) and $(C age), the program prints an error: )
zh_cn: $(P 当输入不能转换到 $(C name) 和 $(C age) 时，程序打印一个错误： )

source: $(P When the type of $(C s) is $(C char[]), the type of the expression on the right-hand side of the assignment above is $(C char[]) as well.
zh_cn: $(P 当 $(C s) 的类型是 $(C char[])，上面右手侧赋值的表达式类型也是 $(C char[]) ，

source: $(P When the variables provide access to the same object, $(C is) returns $(C true): )
zh_cn: $(P 当变量提供对同一对象的访问时，$(C is) 返回 $(C true)： )

source: $(P 上面这个函数首先修改引用参数，当出现异常时再恢复修改。不幸的是，$(C addend) 只能在定义它的 $(C try) 块里访问。$(I ($(B 注：) 这与命名作用域，以及对象生存期有关，这将在 $(LINK2 /ders/d.cn/lifetimes.html, 后面的章节) 中解释。)) )
zh_cn: $(P 上面这个函数首先修改引用参数，当出现异常时再恢复修改。不幸的是，$(C addend) 只能在定义它的 $(C try) 块里访问。$(I ($(B 注：) 这与命名作用域，以及对象生存期有关，这将在 $(LINK2 /ders/d.cn/lifetimes.html, 后面的一章) 中解释。)) )

source: $(P 与结构不同的是一些成员函数自动继承自 $(C Object) 类。在 $(LINK2 /ders/d.cn/inheritance.html, 下一章节) 我们将看到怎样通过$(C override) 关键字来修改 $(C toString) 的定义。 )
zh_cn: $(P 与结构不同的是一些成员函数自动继承自 $(C Object) 类。在 $(LINK2 /ders/d.cn/inheritance.html, 下一章) 中我们将看到怎样通过$(C override) 关键字来修改 $(C toString) 的定义。 )

source: $(P 与结构的最大区别是结构是 $(I 值类型) 类是 $(I 引用类型)。下面的其它不同大部分与此有关。 )
zh_cn: $(P 与结构的最大区别是结构是 $(I 值类型) 而类是 $(I 引用类型)。下面的其它不同大部分与此有关。 )

source: $(P 例如，让我们用 $(C scope(failure)) 语句写一下面的函数： )
zh_cn: $(P 例如，让我们用 $(C scope(failure)) 语句写一下下面的函数： )

source: $(P 另一方面，类变量是用于访问类对象的一种语言特性。虽然语法上看起来是在类 $(I 变量) 上执行，但实际上调度了一个类 $(I object)。 )
zh_cn: $(P 另一方面，类变量是用于访问类对象的一种语言特性。虽然语法上看起来是在类 $(I 变量) 上执行，但实际上调度了一个类 $(I 对象)。 )

source: $(P 在 $(LINK2 /ders/d.cn/null_is.html, The $(CH4 null) 值和 $(CH4 is) 运算符章节)， 本书已简要的提到，类变量可以是 $(C null)。换句话说，类变量可以不提供对任何对象的访问。类变量没有值本身；实际的类对象必须由 $(C new) 关键字构造。 )
zh_cn: $(P 在 $(LINK2 /ders/d.cn/null_is.html, $(CH4 null) 值和 $(CH4 is) 运算符一章) 中， 本书已简要的提到，类变量可以是 $(C null)。换句话说，类变量可以不提供对任何对象的访问。类变量没有值本身；实际的类对象必须由 $(C new) 关键字构造。 )

source: $(P 在上面的代码中， $(C variable2) 由 $(C variable1) 初始化。这俩变量可访问同一对象。The two variables start providing access to the same object.
zh_cn: $(P 在上面的代码中， $(C variable2) 由 $(C variable1) 初始化。这俩变量可访问同一对象。

source: $(P 封装是通过 $(I 保护属性) 来实现， 在 $(LINK2 /ders/d.cn/encapsulation.html, 稍后的章节) 将会看到。继承是用于获取其它类型的 $(I 实现) 。$(LINK2 /ders/d.cn/inheritance.html, 多态性) 是从类之间抽象出部分代码，通过 $(I 接口) 来实现。 )
zh_cn: $(P 封装是通过 $(I 保护属性) 来实现， 在 $(LINK2 /ders/d.cn/encapsulation.html, 稍后的一章) 中将会看到。继承是用于获取其它类型的 $(I 实现) 。$(LINK2 /ders/d.cn/inheritance.html, 多态性) 是从类之间抽象出部分代码，通过 $(I 接口) 来实现。 )

source: $(P 我们将在后面看到 $(LINK2 /ders/d.cn/memory.html, 内存管理章节)，类的析构函数必须遵守以下规则： )
zh_cn: $(P 我们将在后面 $(LINK2 /ders/d.cn/memory.html, 内存管理一章) 中看到，类的析构函数必须遵守以下规则： )

source: $(P 虽然成员函数的定义与用法与结构相同，有个重要的不同：类成员函数默认是 $(I 可重写的) 。在 $(LINK2 /ders/d.cn/inheritance.html,继承章节) 我们将看到相关内容。 )
zh_cn: $(P 虽然成员函数的定义与用法与结构相同，有个重要的不同：类成员函数默认是 $(I 可重写的) 。在 $(LINK2 /ders/d.cn/inheritance.html,继承一章) 中我们将看到相关内容。 )

source: $(P 让我们考虑一下下面我们以前在 $(LINK2 /ders/d.cn/value_vs_reference.html, 值类型和引用类型章节) 看到过的代码： )
zh_cn: $(P 让我们考虑一下下面的我们以前在 $(LINK2 /ders/d.cn/value_vs_reference.html, 值类型和引用类型一章) 中看到过的代码： )

source: $(PROBLEM How can all of the key-value pairs of an associative array be removed other than calling $(C .clear)?
zh_cn: $(PROBLEM 除 $(C .clear) 函数外还有什么方法能移除关联数组的全部键值对？

source: $(PROBLEM Just like with arrays, there can be only one value for each key.
zh_cn: $(PROBLEM 与数组一样，每个键有且仅有一个值。

source: $(SHELL_NOTE (Let's assume that Enter is pressed a second time here)) )
zh_cn: $(SHELL_NOTE (让我们假设在这儿第二次按了Enter键)) )

source: $(SHELL_NOTE The input is not terminated although Enter has been pressed)
zh_cn: $(SHELL_NOTE 虽然按了Enter键，但输入没有中断)

source: $(SHELL_NOTE no new-line character) )
zh_cn: $(SHELL_NOTE 没有新行符) )

source: $(SHELL_NOTE_WRONG (one more before the exclamation mark)) )
zh_cn: $(SHELL_NOTE_WRONG (在感叹号前还有一个)) )

source: $(SHELL_NOTE_WRONG new-line character after the name) !
zh_cn: $(SHELL_NOTE_WRONG 名字之后的新行符) !

source: $(SHELL_NOTE_WRONG new-line character before the exclamation mark) )
zh_cn: $(SHELL_NOTE_WRONG 感叹号前有新行符) )

source: $(STRING 'a') is a character; $(STRING "a") is a string that contains a single character.
zh_cn: $(STRING 'a') 是一个字符；$(STRING "a") 是一个包含单字符的字符串。

source: $(UL $(LI $(C scope(exit)): the expression is always executed when exiting the scope, regardless of whether successfully or due to an exception)
zh_cn: $(UL $(LI $(C scope(exit))：表达式总是在退出作用域时被执行， 无论是否成功或出现异常。)

source: ($(C .clear) is the most natural method.) There are at least three methods:
zh_cn: ($(C .clear) 是最自然的方法。) 至少还有三种方法：

source: (We will see D's $(I immutability) concept in later chapters.) )
zh_cn: (在稍后的章节我们将看到 D的$(I 不可变性) 概念。) )

source: (anonymous MyClass object) variable1 variable2
zh_cn: (匿名的 MyClass 对象) variable1 variable2

source: ) $(LI The $(C char[]) on the left-hand side is a slice, which, if the code compiled, would provide access to all of the characters of the right-hand side.
zh_cn: ) $(LI 左手侧的 $(C char[]) 是一个切片，代码编译时，它会访问右手侧的全部字符。

source: * associative array is being defined with an extra
zh_cn: *关联数组在定义时附加了额外的空格，

source: * see the 'foreach' loop in the next chapter.
zh_cn: *看到‘foreach’循环。

source: * space in between to help distinguish the value type: */
zh_cn: * 以易于区分值类型： */

source: * the value type is int[], i.e. an array of ints.
zh_cn: * 值类型为 int[] ，即整型数组。

source: * used for appending the new grade to that array: */
zh_cn: * 将用于附加新成绩：*/

source: /* 'foreach' is similar but superior to 'for'.
zh_cn: /* ‘foreach’类似于‘for’，但比它更有优势。

source: /* Printing the grades of "emre": */
zh_cn: /* 打印“emre”的成绩： */

source: /* The array of ints that correspond to "emre" is being
zh_cn: /* 与“emre” 对应的整型数组

source: /* The key type of this associative array is string and
zh_cn: /* 该关联数组的键类型为 string，

source: // associates value 0 with key "Monday"
zh_cn: // 关联值 0 与 键 “Monday”

source: // associates value 1 with key "Tuesday"
zh_cn: // 关联值 1 与 键 “Tuesday”

source: // key "purple" does not exist in the table
zh_cn: //表中不存在 键 “purple”

source: // key "purple" exists in the table
zh_cn: // 键 “purple” 在表中

source: A benefit of $(C scope(failure)) is the fact that the expression that reverts another expression is written close to it.
zh_cn: $(C scope(failure)) 的好处是靠近它的表达式可以还原已写的另一个表达式。

source: Also, unlike arrays, the elements of hash tables are not stored side-by-side.
zh_cn: 不像数组，hash 表的元素不是逐个排列存储的。

source: Although it may seem syntactically that operations are being performed on a class $(I variable), the operations are actually dispatched to a class $(I object).
zh_cn: 虽然语法上看起来是在类 $(I 变量) 上执行，但实际上调度了一个类 $(I object)。

source: Although this difference makes associative arrays use more memory, it also allows them to use $(I sparse) key values.
zh_cn: 虽然这种不同让关联数组使用更多内存，但它也允许它们使用$(I 稀疏)键值。

source: An array that stores the names of the days of the week can be defined like this: )
zh_cn: 一个存储了星期的英文名称的数组可以这样定义： )

source: Arrays of these character types lead to three separate string types, some of which may have surprising outcomes in some string operations.
zh_cn: 这些字符类型的数组导致三种独立的字符串类型， 其中一些可能会在一些字符串操作上有出人意料的结果。

source: As we have seen in the $(LINK2 /ders/d.en/characters.html, Characters chapter), D has three separate character types.
zh_cn: 正如我们在 $(LINK2 /ders/d.cn/characters.html, 字符一章) 中看到的， D具有三种独立的字符类型。

source: Assigning that return value back to $(C name) produces the intended output: )
zh_cn: 返回值再赋值给 $(C name)，得到预期的输出： )

source: Associative arrays are initialized similarly to regular arrays, using a colon to separate each key from its respective value: )
zh_cn: 关联数组的初始化与常规数组相似，不同的是用冒号分隔每个键与相应的值： )

source: Associative arrays store their elements as key-value pairs.
zh_cn: 关联数组通过键值对存储它们的元素。

source: Because array elements are stored side-by-side in memory, index values are implicitly the relative positions of elements from the beginning of the array.
zh_cn: 因为在内存中数组元素是逐个存储的，索引值就是元素位置与数组的起始位置的相对值。

source: Being value types, $(C o) and $(C i) are copied automatically.
zh_cn: 做为值类型，$(C o) 和 $(C i) 自动被复制。

source: Chaining the result of $(C readln()) to $(C strip()) enables a shorter and more readable syntax: )
zh_cn: 链接 $(C readln()) 的结果到 $(C strip())，能得到更短且可读性更好的语法： )

source: Checking against $(C null) must be done by $(C is) or $(C !is), not by $(C ==) or $(C !=).
zh_cn: 检查 $(C null) 必须使用 $(C is) 或 $(C !is)，而不是 $(C ==) 或 $(C !=)。

source: Class variables do not have members, the class objects do.
zh_cn: 类变量没有成员，类对象有。

source: DESCRIPTION=Programming in D exercise solutions: Associative Arrays
zh_cn: DESCRIPTION=D语言习题解答：关联数组

source: DESCRIPTION=Programming in D exercise solutions: strings
zh_cn: DESCRIPTION=D语言编程习题解答：字符串

source: DESCRIPTION=The associative arrays of the d programming language.
zh_cn: DESCRIPTION=D语言的关联数组。

source: DESCRIPTION=The basic object oriented programming (OOP) feature of the D programming language.
zh_cn: DESCRIPTION=D语言基本的面向对象编程 (OOP) 功能。

source: DESCRIPTION=The scope(success), scope(failure), and scope(exit) statements that are used for specifying expressions that must be executed when exiting scopes.
zh_cn: DESCRIPTION=scope(success)，scope(failure)，和 scope(exit) 语句用于当退出作用域时一定要执行的特殊表达式。

source: Define an associative array that can store multiple grades per student.
zh_cn: 定义一个能存储每个学生的多个成绩的关联数组。

source: Even though the two objects are constructed by the same character $(C'♔'), they are still two separate objects.
zh_cn: 即使这两个对象由同一字符 $(C'♔') 参数构造，, 它们仍是两个单独的对象。

source: Executing the $(C scope) statements in reverse order enables undoing side effects of earlier expressions in a consistent order.
zh_cn: 这样按相反顺序执行 $(C scope) 语句，让程序能按一致的顺序撤消前边表达式的副作用。

source: For classes, the meaning of $(C opAssign) is always $(I associating a class variable with a class object).
zh_cn: 对于类， $(C opAssign) 意味着 $(I 一个类变量总是关联着一个类对象)。

source: For example, $(C char[]) is a type of string.
zh_cn: 例如，$(C char[]) 字符串类型。

source: For example, $(C dayNumbers) would have two key-value pairs after the operations above.
zh_cn: 例如，上面的操作结束后 $(C dayNumbers) 将有两个键值对。

source: For example, as the $(C formattedRead()) call above expects to read $(I two) items (a $(C string) as name and an $(C int) as age), the following check ensures that it really is the case: )
zh_cn: 例如，像上面的 $(C formattedRead()) 函数期望去读$(I 两个)项目(一个 $(C string) 型 name 和一个 $(C int) 型 age)，下面的检查确定它真是这样： )

source: For example, if $(C s) is a variable of type $(C char[]), the following line will fail to compile: )
zh_cn: 例如，如果 $(C s) 的变量类型是 $(C char[])，下面这行将编译失败： )

source: For example, let's assume that the grades 90, 85, 95, etc. are to be stored for the student named "emre".
zh_cn: 例如，我们假设存储学生“emre”的成绩 90，85，95 等等。

source: For example, the characters of a $(C wchar[]) can be modified but the characters of a $(C wstring) cannot be modified.
zh_cn: 例如，可以修改一个 $(C wchar[]) ，但不可修改一个 $(C wstring) 。

source: For example, the special value of -1 can be used as the code for colors that are not in $(C colorCodes).
zh_cn: 例如，特殊值 -1 用作不在 $(C colorCodes) 中的 colors 代码。

source: For example, when there are just two elements to store for keys 0 and 999, an associative array stores just two elements, not 1000 as a plain array has to.
zh_cn: 例如，对于键 0 和 999，当只有两个元素要存储时，关联数组就只存储两个元素，而不像简单数组那样必须 1000 个。

source: For that reason, when we assign a new key-value pair and the key already exists, the table does not grow; instead, the value of the existing key changes: )
zh_cn: 因而，给一个存在的键赋值，表不增长，而现有键所对应的值会发生变化： )

source: For these reasons, $(C readf()) does not work as intended when reading strings: )
zh_cn: 因而，$(C readf()) 不能如愿读取字符串： )

source: Further, because there is no way to tell $(C readf()) how many characters to read, it continues to read until the end of the entire input.
zh_cn: 另外，因为没有办法告诉 $(C readf()) 要读取多少字符， 它持续读，直到整个输入结束。

source: Hash tables are among the fastest collections for storing and accessing elements.
zh_cn: Hash 表是存储和访问元素的最快的集合。

source: However, the grades cannot be inserted as in the following code because each grade would overwrite the previous one: )
zh_cn: 然而，不能像下面的代码这样插入成绩，因为后来的成绩将覆盖前一个： )

source: If the user eventually terminates the input that way, we see that the new-line characters have been read as parts of the string as well: )
zh_cn: 如果用户最后这样结束输入，我们看到新行符已作为字符串的一部分被读取： )

source: In order to copy class objects, the type must have a special function likely named $(C dup()).
zh_cn: 为了复制类对象，类型必须有一个类似于命名为 $(C dup()) 的特殊函数。

source: In other words, $(C opAssign) cannot be overloaded for them.
zh_cn: 换句话说，$(C opAssign) 不能因为它们而被重载。

source: In other words, arrays map indexes to values.
zh_cn: 换句话说，数组映射索引到值。

source: In other words, it can be used as the opposite of the $(C dayNames) array at the beginning of this chapter.
zh_cn: 换句话说，它能用作本章开始处 $(C dayNames) 数组的逆转。

source: In such cases, the $(C .idup) property can be used to produce an immutable $(C string) variable from a mutable $(C char[]) variable.
zh_cn: 这种情况下，$(C .idup) property 能被用来从一个可变的 $(C char[]) 变量产生一个不可变的 $(C string) 变量。

source: In that case it $(I returns) the line that it has just read.
zh_cn: 在这种情况下它$(I 返回)刚刚读入的行。

source: In the simplest definition, strings are nothing but arrays of characters.
zh_cn: 在最简单的定义中，字符串只不过是字符数组。

source: It is used differently because the $(STRING " %s") format string and the $(C &) operator are not needed: )
zh_cn: 不同的是没有 $(STRING " %s") 格式字符串并且不需要 $(C &) 运算符： )

source: It returns $(C true) if the object is the same and $(C false) otherwise.
zh_cn: 如果是同一对象，返回 $(C true) ，否则为 $(C false) 。

source: Iterating over this slice and removing the element for each key by calling $(C .remove) would result in an empty associative array:
zh_cn: 迭代这个切片，通过为每个键调用 $(C .remove) 函数来移除元素，就会形成一个空的关联数组：

source: Its first parameter is the line that contains the data, and the rest of the parameters are used exacly like $(C readf()): )
zh_cn: 它的第一个参数是包含数据的行，剩余的参数可以像 $(C readf()) 那样精确使用： )

source: KEYWORDS=d programming language tutorial book associative arrays
zh_cn: KEYWORDS=D 编程语言教程 关联数组

source: KEYWORDS=d programming language tutorial book scope
zh_cn: KEYWORDS=D 语言编程教程 scope

source: KEYWORDS=d programming lesson book tutorial class
zh_cn: KEYWORDS=D 语言编程教程 class

source: KEYWORDS=programming in d tutorial associative arrays
zh_cn: KEYWORDS=D语言教程 关联数组

source: Let's see this on a class that has various types of members: )
zh_cn: 让我们在有各种类型成员的类上看看它：: )

source: Like $(C finally), the three different $(C scope) statements are about executing expressions when leaving scopes: )
zh_cn: 像 $(C finally)，下面三个不同的 $(C scope) 语句就是关于离开作用域时应执行的表达式： )

source: Note that the constructor copies the $(C s) member explicitly by the $(C .dup) property of arrays.
zh_cn: 注意，构造函数通过数组的 $(C .dup) 属性显式复制 $(C s) 成员。

source: Other than in rare pathological cases, the time it takes to store or access an element is independent of the number of elements that are in the associative array.
zh_cn: 除极个别情况外，一般存取单个元素所花费的时间不依赖于关联数组中元素的个数。

source: Plain arrays can use only integers as indexes.
zh_cn: 简单数组只能使用整型做索引。

source: S o; // assume S is a struct type
zh_cn: S o; // 假设 S 是一个结构类型

source: SUBTITLE=Associative Arrays
zh_cn: SUBTITLE=关联数组

source: SUBTITLE=Associative Arrays Solutions
zh_cn: SUBTITLE=关联数组 习题解答

source: SUBTITLE=Classes
zh_cn: SUBTITLE=类

source: SUBTITLE=Strings Solution
zh_cn: SUBTITLE=字符串 习题解答

source: Short for "read line", $(C readln()) reads until the end of the line.
zh_cn: 它是“read line”的缩写，$(C readln()) 读取到行尾。

source: Since multiple grades can be stored in a dynamic array, an associative array that maps from $(C string) to $(C int[]) would work here.
zh_cn: 由于多个成绩可以用一个动态数组存储，从 $(C string) 到 $(C int[]) 映射的关联数组将能用在这儿。

source: Since that key is not in the container anymore, the second line would cause an exception to be thrown and the program to be terminated if that exception is not caught.
zh_cn: 由于键已不存在于容器中， 因而第二行将引发一个异常，如果异常没有被捕获，程序将终止。

source: Since there is no other variable for $(C variable1)'s original object, that object will be destroyed by the garbage collector.
zh_cn: 由于 $(C variable1) 的原始对象没有别的变量，该对象将由垃圾回收器销毁。

source: String literals are defined with double quotes.
zh_cn: 字符串字面量用双引号定义。

source: Strings are a combination of the two features that we have covered in the last three chapters: characters and arrays.
zh_cn: 字符串是在过去三章中介绍的两种功能的组合：字符和数组。

source: That value can be compared against the expected number of data items so that the input can be validated.
zh_cn: 该值可与数据项目的期望个数相比较，以便确定输入的有效性。

source: The
zh_cn: 这个

source: The $(C king) variable does not have a $(C shape) member, the anonymous object does.
zh_cn: $(C king) 变量并没有 $(C shape) 成员，匿名对象有。

source: The $(C new) keyword constructs an anonymous $(I class object) and returns a $(I class variable).
zh_cn: The $(C new) 关键字构造一个匿名 $(I class 对象) 并返回一个 $(I class 变量)。

source: The actual object is not copied.
zh_cn: 实际的对象没有被复制。

source: The characters of the variables that are defined by these aliases cannot be modified.
zh_cn: 由这些别名定义的字符变量不可修改。

source: The compiler does not allow accessing characters of an immutable array through a mutable slice.
zh_cn: 编译器不允许通过可变的切片访问不可变的字符数组。

source: The default value is specified as the second parameter of $(C .get()): )
zh_cn: 默认值被指定为 $(C .get()) 的第2个参数： )

source: The difference is that it is the type of the key that is specified within the square brackets, not the length of the array: )
zh_cn: 不同的是方框号中指定的是键的类型，而不是数组的长度： )

source: The following methods would empty the array in a single step.
zh_cn: 而下面的方法将用一步清空数组。

source: The grades can be appended to the dynamic arrays that are stored in the associative array:
zh_cn: 成绩能附加到存储在关联数组中的动态数组上：

source: The two variables start providing access to the same object.
zh_cn: 这俩变量可访问同一对象。The two variables start providing access to the same object.

source: The values of the type that associative arrays $(I map from) are called $(I keys), rather than indexes.
zh_cn: 关联数组用于$(I 映射)的类型的值叫$(I 键)，而不是索引。

source: They are very fast data structures that work like mini databases and are used in many programs.
zh_cn: 它们是高速的数据结构，如迷你数据库一样地运作，在很多程序里都用到了。

source: They grow automatically as key-value pairs are added.
zh_cn: 它们随着键值对的添加而自动增长。

source: They map the values of one type to the values of another type.
zh_cn: 它们映射一种类型的值到另一种类型的值上。

source: This behavior cannot be changed.
zh_cn: 该行为不能被修改。

source: This can be demonstrated by printing the entire table: )
zh_cn: 这可以通过打印整个表来验证： )

source: This distinction has an important consequence when $(LINK2 /ders/d.en/function_parameters.html, passing associative arrays to functions).
zh_cn: 当 $(LINK2 /ders/d.cn/function_parameters.html, 传关联数组给函数) 时，这种区分具有重要意义。

source: This function must create and return a new class object.
zh_cn: 该函数必须创建并返回一个新的类对象。

source: This is because later code may depend on previous variables.
zh_cn: 这是因为后边的代码依赖于前边的变量。

source: This is so that the program has a way of determining whether the input consisted of a complete line or whether the end of input has been reached: )
zh_cn: 这就让程序有办法确定输入是否包含一条完整语句或者输入是否已结束： )

source: This may be seen as a limitation for some applications.
zh_cn: 对某些程序来说可能是个限制。

source: To be compatible with arrays, this function may be named $(C dup()).
zh_cn: 为与数组兼容，该函数可以命名为 $(C dup()).

source: Unfortunately, $(C addend) is accessible only in the $(C try) block, where it is defined.
zh_cn: 不幸的是，$(C addend) 只能在定义它的 $(C try) 块里访问。

source: Unlike structs, class objects cannot be constructed by the $(C {&nbsp;}) syntax.
zh_cn: 不像结构，类对象不能由 $(C {&nbsp;}) 语法构造。

source: We will
zh_cn: 在下一章我们将

source: We will cover these concepts in later chapters.) )
zh_cn: 在稍后的章节中我们将涵盖这些概念。) )

source: We will see Phobos ranges in a later chapter.
zh_cn: 在稍后的一章中我们将看到 Phobos ranges 。

source: We will see exceptions in $(LINK2 /ders/d.en/exceptions.html, a later chapter).
zh_cn: 在 $(LINK2 /ders/d.cn/exceptions.html, 稍后的一章) 中我们将看到异常。

source: We will see in $(LINK2 /ders/d.en/inheritance.html, the next chapter) how the definition of $(C toString) can be changed by the $(C override) keyword.
zh_cn: 在 $(LINK2 /ders/d.cn/inheritance.html, 下一章节) 我们将看到怎样通过$(C override) 关键字来修改 $(C toString) 的定义。

source: We will see this concept later in $(LINK2 /ders/d.en/inheritance.html, the Inheritance chapter).
zh_cn: 在 $(LINK2 /ders/d.cn/inheritance.html,继承章节) 我们将看到相关内容。

source: We will see user-defined types in later chapters.
zh_cn: 在稍后的章节中我们将看到用户定义类型。

source: We will use the $(C dayNumbers) associative array in the examples below.
zh_cn: 在下面的例子中我们将使用 $(C dayNumbers) 关联数组。

source: When reading strings from the input, the control character that corresponds to the Enter key that is pressed at the end of the input becomes a part of the string as well.
zh_cn: 当从输入中读取字符串，输入结束时按的Enter键对应的控制字符将变成字符串的一部分。

source: When that exact syntax is desired, properties should be preferred, which will be explained in $(LINK2 /ders/d.en/property.html, a later chapter).) )
zh_cn: 若确实需要这样的语法，应该首选属性，这将在 $(LINK2 /ders/d.cn/property.html, 后面的章节) 中解释。) )

source: You can apply this guideline blindly unless there are compilation errors: )
zh_cn: 若没有编译错误，您可以闭着眼睛按教程来： )

source: You may find especially the Phobos ranges confusing at this point.
zh_cn: 在这一点上，你会发现 Phobos 的让人迷惑的 ranges 尤其明显。

source: dayNumbers.clear; // The associative array becomes empty ---
zh_cn: dayNumbers.clear; // 清空关联数组 ---

source: grades["emre"] = 85; // ← Overwrites the previous grade!
zh_cn: grades["emre"] = 85; // ← 覆盖前一个成绩！

source: number = int.init; // 0 for int --- )
zh_cn: number = int.init; // int 值：0 --- )

source: string result = (s ~ '.')$(HILITE .idup); // ← now compiles ---
zh_cn: string result = (s ~ '.')$(HILITE .idup); // ← 现在可以编译 ---

source: writeln(dayNames[1]); // prints "Tuesday" ---
zh_cn: writeln(dayNames[1]); // 打印 “Tuesday” ---

source: writeln(dayNumbers["Tuesday"]); // prints 1 ---
zh_cn: writeln(dayNumbers["Tuesday"]); // 打印 1 ---

source: writeln(dayNumbers["Tuesday"]); // ← run-time ERROR ---
zh_cn: writeln(dayNumbers["Tuesday"]); // ← 运行时错误 ---
